back_end/app/services/comic_serializer.rb

    def comic_pages
        ComicPage.with_attached_image.where(comic_id: object.id)
---
SELECT "comic_pages".* FROM "comic_pages" WHERE "comic_pages"."comic_id" = ?  [["comic_id", 1]]