back_end/app/controllers/comic_pages_controller.rb

  def index
        @comic_pages = ComicPage.all
---
SELECT "comic_pages".* FROM "comic_pages" WHERE (edit) LIMIT ?  [["LIMIT", 1]]

  def show
      @comic_page = ComicPage.find_by(id: params[:id])
---
SELECT "comic_pages".* FROM "comic_pages" WHERE "comic_pages"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def edit
      @comic_page = ComicPage.find(params[:id])
---
SELECT "comic_pages".* FROM "comic_pages" WHERE "comic_pages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]