back_end/app/controllers/comics_controller.rb

  def index
    comics = Comic.all
---
SELECT "comics".* FROM "comics"

  def show
    @comic = Comic.find(params[:id])
---
SELECT "comics".* FROM "comics" WHERE "comics"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]