back_end/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    comment = Comment.find_by(id: params[:id])